<template>
  <div class="about">
    <p>
      Pretendard에서는 본고딕 소스로부터 Black 마스터를 만들어낸 뒤 이를 9개
      글자가족으로 분화해 본고딕에는 없던 SemiBold와 ExtraBold 굵기를 지원한다.
      또한 가변 속성을 지원해 타이포그래피 트렌드에서 굵기에 대한 얼마큼의 타협
      없이 생각하는 만큼 쓰는 것도 가능하다.
    </p>
    <p>
      system-ui를 대체하는 글꼴 Apple의 system-ui가 익숙한 나로서는 San
      Francisco와 Apple SD 산돌고딕 Neo가 없는 다른 환경에서 이를 대체할 수 있는
      글꼴을 꾸준히 갈망해왔다. Inter는 San Francisco가 없는 다른 환경에서 대체
      역할을 쏠쏠히 해오고 있다고는 하지만, 타협 없이 네오 그로테스크의 뜻을
      가진 San Francisco와 달리 몇몇 소문자 글자가 휴머니스트적인 인상을 가지고
      있기 때문에, 이를 다듬어 아예 완벽한 따라쟁이를 만들어버리는 것은 어떨까
      싶은 것이다. 이어서 맑은 고딕과 나눔고딕을 대신해 본문용 무료 글꼴의
      대명사로 쓰이고 있는 Noto Sans KR—본고딕은, 그 글자를 조형하는 여러
      사람들이 공통적으로 자간을 조정하는 데 시간을 쏟고 있다는 것과, 본고딕의
      한글 크기가 대부분의 한글 글꼴들과 비슷하게 다국어 타이포그래피 환경에서는
      조금 크게 자리잡아 라틴 글자와 섞어쓸 때 글자 비율을 어느정도 조정해서
      쓰는 점이 제품을 만드는 데 어느정도 부채가 쌓이는 상황이라 보았고, 이처럼
      적합하지 않은 글꼴로부터 생기는 추가적인 소요를 줄이자는 데에서 이
      프로젝트를 2020년 11월부터 천천히 다듬어왔다. 기본적인 글꼴 방향은 주어진
      리소스가 허락하는 선에서 최대한 눈에 익숙하며, 글꼴에 구태여 손을 보지
      않아도 되게끔 만들자였다. Apple의 타이포그래피 환경에 익숙해 다른
      환경에서도 그러한 조형과 얼마큼 함께하길 바란다면, 또는 표준을 구성하는 데
      마땅한 글꼴이 없어 어려움이 있는 상황이라면 이 글꼴이 도움이 되었으면
      한다.
    </p>
  </div>
</template>
